<?php
function HandlePost(){
  $物业管理费=floatval(I(md5("管理费用标准"),0));
  $管理费用标准=$物业管理费;
  $总建筑面积=intval(I(md5("总建筑面积"),0));
  
  if($物业管理费<1)return array("项目名称","请输入项目名称");
  
  
  //if($总建筑面积<40000)return false;
  $服务等级O=I(md5("服务等级"),"B");
  $服务等级=W(
  
    $管理费用标准 > 0?
	W(
      $物业管理费<=2?"BM":"",
      $物业管理费<=5?"B":"",
      $物业管理费<=8?"A":"",
      "AA"
    ):0,
	
    W(
      //$物业管理费<=10?"B":"",
      $物业管理费<=10?"A":"",
      "AA"
    )
  );

  if($服务等级O!=$服务等级){param(md5("服务等级"),$服务等级);}
  return false;
}
HandlePost();