<?php
function HandlePost(){
  $项目名称=I(md5("项目名称"));
  if(!strlen($项目名称)){
    return array("项目名称","请输入项目名称");
  }
  $地下室层数=I(md5("地下室层数"),0);
  $物业管理费=I(md5("管理费用标准"),0);
  $管理费用标准=$物业管理费;

  $楼栋数量=I(md5("楼栋数量"),0);
  $楼栋层数=I(md5("楼栋层数"),0);  
  $服务等级=I(md5("服务等级"),"B");

  $总建筑面积=I(md5("总建筑面积"),0);
  
  $室内公共面积=I(md5("室内公共面积"),0);
  $外围地面面积=I(md5("外围地面面积"),0);
  $地下室面积=I(md5("地下室面积"),0);
  $绿化面积=I(md5("绿化面积"),0);
  $VIP区域面积=I(md5("VIP区域面积"),0);
  $大堂面积=I(md5("大堂面积"),0);

  $洗手间数量=I(md5("洗手间数量"),0);
  $大垃圾桶=I(md5("大垃圾桶"),0);
  $外围垃圾桶=I(md5("外围垃圾桶"),0);
  $实际办公总人数=I(md5("实际办公总人数"),0);

  //小垃圾袋BOF
  $大堂数量=I(md5("大堂数量"),0);
  $洗手间蹲位=I(md5("洗手间蹲位"),0);
  $茶水间=I(md5("茶水间"),0);
  $吸烟室=I(md5("吸烟室"),0);
  $烟灰盅=I(md5("烟灰盅"),0);
  $车场岗亭=I(md5("车场岗亭"),0);
  //小垃圾袋=$大堂数量+$洗手间数量+$洗手间蹲位+$茶水间+$吸烟室+$烟灰盅+$车场岗亭
  //小垃圾袋EOF
  
  
  $服务等级=W(
    $总建筑面积<=20000?W(
      $物业管理费<=12?"BM":"",
      $物业管理费<=20?"B":"",
      $物业管理费<25?"A":"",
      "AA"
    ):0,
    $总建筑面积<=40000?W(
      $物业管理费<=10?"BM":"",
      $物业管理费<=14?"B":"",
      $物业管理费<17?"A":"",
      "AA"
    ):0,
    $总建筑面积<=70000?W(
      $物业管理费<=7.3?"BM":"",
      $物业管理费<=11?"B":"",
      $物业管理费<15?"A":"",
      "AA"
    ):0,
    $总建筑面积<=100000?W(
      $物业管理费<=6?"BM":"",
      $物业管理费<=9?"B":"",
      $物业管理费<14?"A":"",
      "AA"
    ):0,
    $总建筑面积<=130000?W(
      $物业管理费<=5.2?"BM":"",
      $物业管理费<=7.8?"B":"",
      $物业管理费<12.5?"A":"",
      "AA"
    ):0,
    $总建筑面积<200000?W(
      $物业管理费<=8?"B":"",
      $物业管理费<14?"A":"",
      "AA"
    ):0,
    W(
      //$物业管理费<=10?"B":"",
      $物业管理费<13?"A":"",
      "AA"
    )
  );

  if(!is_numeric($管理费用标准)){
    return array("管理费用标准","请正确输入物业管理费");
  }
  if(!is_numeric($总建筑面积)){
    return array("总建筑面积","请正确输入总建筑面积");
  }

  foreach (explode("|","容积率|地下室层数|楼栋数量|楼栋层数|室内公共面积|外围地面面积|地下室面积|绿化面积|VIP区域面积|大堂面积|洗手间数量|实际办公总人数|大堂数量") as $key) {
    if(!is_numeric(I(md5($key),0))){
      return array($key,"请正确输入".$key);
    }
  }
  foreach (explode("|","大垃圾桶|外围垃圾桶|洗手间蹲位|茶水间|吸烟室|烟灰盅|车场岗亭"."|餐厅") as $key) {
    if(!is_numeric(I(md5($key),0))){
      return array($key,"请正确输入".$key."数量");
    }
  }

  $乙级以下=round(W(
    $总建筑面积<=25000?$总建筑面积/2200:0,
    $总建筑面积<=35000?$总建筑面积/3500:0,
    $总建筑面积<=50000?$总建筑面积/4000:0,
    $总建筑面积<=100000?$总建筑面积/4000:0,
    $总建筑面积<=150000?$总建筑面积/5000:0,
    $总建筑面积<=200000?$总建筑面积/7000:0,
    $总建筑面积/7000
  ));
  $乙级=round(W(
    $总建筑面积<=25000?$总建筑面积/1600:0,
    $总建筑面积<=35000?$总建筑面积/2700:0,
    $总建筑面积<=50000?$总建筑面积/3200:0,
    $总建筑面积<=100000?$总建筑面积/3500:0,
    $总建筑面积<=150000?$总建筑面积/4000:0,
    $总建筑面积<=200000?$总建筑面积/5000:0,
    $总建筑面积/5500
  ));
  $甲级=round(W(
    $总建筑面积<=25000?$总建筑面积/1200:0,
    $总建筑面积<=35000?$总建筑面积/1800:0,
    $总建筑面积<=50000?$总建筑面积/2200:0,
    $总建筑面积<=100000?$总建筑面积/2400:0,
    $总建筑面积<=150000?$总建筑面积/2600:0,
    $总建筑面积<=200000?$总建筑面积/3600:0,
    $总建筑面积/3800
  ));
  $超甲级=round(W(
    $总建筑面积<=25000?$总建筑面积/1000:0,
    $总建筑面积<=35000?$总建筑面积/1200:0,
    $总建筑面积<=50000?$总建筑面积/1500:0,
    $总建筑面积<=100000?$总建筑面积/1700:0,
    $总建筑面积<=150000?$总建筑面积/1850:0,
    $总建筑面积<=200000?$总建筑面积/2200:0,
    $总建筑面积/2500
  ));
  Param(md5("乙级以下"),$乙级以下);
  Param(md5("乙级"),$乙级);
  Param(md5("甲级"),$甲级);
  Param(md5("超甲级"),$超甲级);

  Param(md5("BM大堂"),round($大堂面积/2000));
  Param(md5("B大堂"),round($大堂面积/1500));
  Param(md5("A大堂"),round($大堂面积/1000));
  Param(md5("AA大堂"),round($大堂面积/800));

  Param(md5("BM洗手间"),round($洗手间数量/10));
  Param(md5("B洗手间"),round($洗手间数量/8));
  Param(md5("A洗手间"),round($洗手间数量/5));
  Param(md5("AA洗手间"),round($洗手间数量/4));

  Param(md5("BM室内岗"),round($室内公共面积/3000));
  Param(md5("B室内岗"),round($室内公共面积/2500));
  Param(md5("A室内岗"),round($室内公共面积/2000));
  Param(md5("AA室内岗"),round($室内公共面积/1500));
  
  Param(md5("BM外围地面"),round($外围地面面积/10000));
  Param(md5("B外围地面"),round($外围地面面积/8000));
  Param(md5("A外围地面"),round($外围地面面积/5000));
  Param(md5("AA外围地面"),round($外围地面面积/3000));

  Param(md5("BM地下车库"),round($地下室面积/13000));
  Param(md5("B地下车库"),round($地下室面积/10000));
  Param(md5("A地下车库"),round($地下室面积/8000));
  Param(md5("AA地下车库"),round($地下室面积/5000));
  
  Param(md5("BMVIP客户要求的区域"),round($VIP区域面积/800));
  Param(md5("BVIP客户要求的区域"),round($VIP区域面积/600));
  Param(md5("AVIP客户要求的区域"),round($VIP区域面积/400));
  Param(md5("AAVIP客户要求的区域"),round($VIP区域面积/400));

  Param(md5("BM主管"),1);
  Param(md5("B主管"),1);
  Param(md5("A主管"),1);
  Param(md5("AA主管"),1);

  Param(md5("BM机动"),1);
  Param(md5("B机动"),1);
  Param(md5("A机动"),W(
    $总建筑面积<=50000?1:0,
    $总建筑面积<=100000?2:0,
    $总建筑面积<=150000?3:0,
    $总建筑面积<=200000?4:0,
    5
  ));
  Param(md5("AA机动"),W(
    $总建筑面积<=50000?3:0,
    $总建筑面积<=100000?4:0,
    $总建筑面积<=150000?5:0,
    $总建筑面积<=200000?6:0,
    8
  ));

  Param(md5("BM领班"),0);
  Param(md5("B领班"),1);
  Param(md5("A领班"),$总建筑面积<=200000?1:2);
  Param(md5("AA领班"),$总建筑面积<=200000?1:2);

  GLOBAL $_FEEDBACK;
  $合计=array("BM"=>0,"B"=>0,"A"=>0,"AA"=>0);
  foreach(explode("|","大堂|洗手间|室内岗|外围地面/车行道|地下车库(包括垃圾房)|VIP客户要求的区域|主管|机动|领班") as $item) {
    $itemname=explode("/",$item);
    $itemname=array_shift($itemname); 
    $itemname=explode("(",$itemname);
    $itemname=array_shift($itemname);
    $合计["BM"]+=$_FEEDBACK["params"][md5("BM".$itemname)];
    $合计["B"]+=$_FEEDBACK["params"][md5("B".$itemname)];
    $合计["A"]+=$_FEEDBACK["params"][md5("A".$itemname)];
    $合计["AA"]+=$_FEEDBACK["params"][md5("AA".$itemname)];
  }

  Param(md5("BM合计"),$合计["BM"]);
  Param(md5("B合计"),$合计["B"]);
  Param(md5("A合计"),$合计["A"]);
  Param(md5("AA合计"),$合计["AA"]);

  $G7G12Count=0;
  foreach(explode("|","大堂|洗手间|室内岗|外围地面/车行道|地下车库(包括垃圾房)|VIP客户要求的区域") as $item) {
    $itemname=explode("/",$item);
    $itemname=array_shift($itemname); 
    $itemname=explode("(",$itemname);
    $itemname=array_shift($itemname);
    if($_FEEDBACK["params"][md5("AA".$itemname)]>0)$G7G12Count++;
  }
  $G14=$_FEEDBACK["params"][md5("AA机动")];

  Param(md5("CC_保洁工具车"),$G7G12Count);
  Param(md5("CC_地拖"),$G7G12Count+($G14>5?2:1));
  Param(md5("CC_尘推"),$G7G12Count+($G14>5?2:1));
  Param(md5("CC_厕刷"),$洗手间数量);
  Param(md5("CC_云石刀"),$G7G12Count+($G14>5?2:1));
  Param(md5("CC_清洁喷壶"),$G7G12Count+($G14>5?2:1));
  Param(md5("CC_涂水器"),($G14>5?2:1));
  Param(md5("CC_玻璃刮刀"),($G14>5?2:1));
  Param(md5("CC_伸缩杆"),($G14>5?2:1));
  Param(md5("CC_竹扫把"),$_FEEDBACK["params"][md5("AA外围地面")]);
  Param(md5("CC_胶扫把"),$G7G12Count+($G14>5?2:1));
  Param(md5("CC_灰斗"),$G7G12Count+($G14>5?2:1));
  Param(md5("CC_毛巾"),$G7G12Count+($G14>5?2:1));
  Param(md5("CC_百洁布"),$G7G12Count+($G14>5?2:1));
  Param(md5("CC_软毛扫把"),$G7G12Count+($G14>5?2:1));
  Param(md5("CC_垃圾铲"),$G7G12Count+($G14>5?2:1));
  Param(md5("CC_消毒液"),$洗手间数量);
  Param(md5("CC_大垃圾袋"),$大垃圾桶+$外围垃圾桶);
  Param(md5("CC_小垃圾袋"),$大堂数量+$洗手间数量+$洗手间蹲位+$茶水间+$吸烟室+$烟灰盅+$车场岗亭);
  Param(md5("CC_通用清洁剂"),$G7G12Count+($G14>5?2:1));
  Param(md5("CC_洁厕剂"),$洗手间数量);
  Param(md5("CC_玻璃清洁剂"),($G14>5?2:1));
  Param(md5("CC_不锈钢光亮剂"),($G14>5?2:1));
  Param(md5("CC_垃圾车"),W(
    $总建筑面积<=50000?2:0,
    $总建筑面积<=100000?3:0,
    $总建筑面积<=150000?4:0,
    5
  ));
  Param(md5("CC_升降机"),$总建筑面积<=150000?1:2);
  Param(md5("CC_吸水机"),($G14>5?2:1));
  Param(md5("CC_吸尘器"),($G14>5?2:1));
  Param(md5("CC_吹干机"),($G14>5?2:1));
  Param(md5("CC_洗地机"),($G14>5?2:1));
  Param(md5("CC_高压水枪"),($G14>5?2:1));
  Param(md5("CC_多用途清洁车"),W(
    $外围地面面积<=20000?1:0,
    $外围地面面积<=50000?2:0,
    3
  ));
  Param(md5("CC_全自动洗地机"),W(
    $大堂面积<5000?1:0,
    $大堂面积<10000?2:0,
    3
  ));
  Param(md5("CC_水管"),round($绿化面积/7000+1));
  Param(md5("CC_晶面粉剂"),3);
  Param(md5("CC_地毯清洗机"),2);
  Param(md5("CC_自动扶梯清洗机"),2);


  Param(md5("WR_自动喷香剂"),$洗手间数量);
  Param(md5("WR_洗手液"),round($实际办公总人数*18.9));
  Param(md5("WR_擦手纸"),round($实际办公总人数*0.63));
  Param(md5("WR_大卷纸"),round($实际办公总人数*0.37));
  
  script("GoPage(7);");
  script("JingsuanLevel(\"{$服务等级}\");");
  return false;
}
$result=HandlePost();
if($result){script("BirdToast(\$(\".JingsuanPost[name='".md5(V($result[0]))."']\").focus(),\"".addslashes(V($result[1]))."\");");}